# Flow Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
PipePressureDropData..::..Flow Property
PipePressureDropData Class See Also
---
The flow of the pipe. Units: (ft³/s).
**Namespace:** Autodesk.Revit.DB.Plumbing**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public double Flow { get; }
```

Visual Basic
---
```text
Public ReadOnly Property Flow As Double
	Get
```

Visual C++
---
```text
public:
property double Flow {
	double get ();
}
```

# See Also
PipePressureDropData Class
Autodesk.Revit.DB.Plumbing Namespace